---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericBumpAmount
source: html/c66a709d-7faa-f433-772b-a0ed53cd7749.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericBumpAmount Property

The property labeled "Amount" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericBumpAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "-1000, 1000".